20260824/20260824/InformationRegisters/СБ_ПоставщикиПоТоварнымКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СБ_ПоставщикиПоТоварнымКатегориям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньЗначимости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТоварнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СБ_КатегорииМатериалов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

20260824/20260824/InformationRegisters/СБ_ПоставщикиПоТоварнымКатегориям/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ДоговорПриИзмененииНаСервере()	
	Запись.Контрагент = Запись.Договор.Партнер;	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда   
		
		Если Параметры.ЗначенияЗаполнения.Свойство("КатегорияМатериала") Тогда
			Запись.ТоварнаяКатегория = Параметры.ЗначенияЗаполнения.КатегорияМатериала;
		КонецЕсли; 
		
		Если Параметры.ЗначенияЗаполнения.Свойство("ГруппаНоменклатуры") Тогда
			Запись.ГруппаНоменклатуры = Параметры.ЗначенияЗаполнения.ГруппаНоменклатуры;
		КонецЕсли;   
		
		Если Параметры.ЗначенияЗаполнения.Свойство("Договор") Тогда
			Запись.Договор = Параметры.ЗначенияЗаполнения.Договор;
		КонецЕсли;

	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Запись.СтепеньЗначимости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Контрагент, "СБ_СтепеньЗначимостиПоставщика");
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры
